Tekla Open API Reference for Tekla Structures 2025
GuidConversion Methods
The GuidConversion type exposes the following members.
Methods
Name | Description
GetGuidMapping
Gets the GUID mapping.
GetNewGuid
Gets the new GUID.
Top
See Also
Reference
GuidConversion Class
Tekla.Structures.Model.Operations Namespace